trade/src/Reports/СоставСегментовРетроБонусовКлиентов/СоставСегментовРетроБонусовКлиентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>СоставСегментовРетроБонусовКлиентов</name>
</mdclass:Report>

trade/src/InformationRegisters/РетроБонусыКлиентовТовары/РетроБонусыКлиентовТовары.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РетроБонусыКлиентовТовары</name>
  <resources>
    <name>БазоваяЦена</name>
    <type>
      <types>DefinedType.Цена</types>
    </type>
  </resources>
  <resources>
    <name>КоличествоПланГраницаДиапазона</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>РегистраторДвижения</name>
    <type>
      <types>DocumentRef.УсловияРетроБонусовКлиентов</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерСтрокиДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>НачалоДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ОкончаниеДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ДокументУсловий</name>
    <type>
      <types>DocumentRef.УсловияРетроБонусовКлиентов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КоличествоПлан</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>БонусПроцент</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

trade/src/InformationRegisters/РетроБонусыКлиентовКонтрагенты/РетроБонусыКлиентовКонтрагенты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РетроБонусыКлиентовКонтрагенты</name>
  <resources>
    <name>СуммаПлан</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
    </type>
  </resources>
  <attributes>
    <name>РегистраторДвижения</name>
    <type>
      <types>DocumentRef.УсловияРетроБонусовКлиентов</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерСтрокиДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>НачалоДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ОкончаниеДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ДокументУсловий</name>
    <type>
      <types>DocumentRef.УсловияРетроБонусовКлиентов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Партнер</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

trade/src/InformationRegisters/РетроБонусыКлиентовУсловия/РетроБонусыКлиентовУсловия.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РетроБонусыКлиентовУсловия</name>
  <resources>
    <name>Вид</name>
    <type>
      <types>CatalogRef.ВидыРетроБонусовКлиентов</types>
    </type>
  </resources>
  <resources>
    <name>Описание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>СоставУчастников</name>
    <type>
      <types>EnumRef.СоставыУчастниковРетроБонусов</types>
    </type>
  </resources>
  <resources>
    <name>Участники</name>
    <type>
      <types>EnumRef.СоставыСписковРетроБонусов</types>
    </type>
  </resources>
  <resources>
    <name>СоставТоваров</name>
    <type>
      <types>EnumRef.СоставыТоваровРетроБонусов</types>
    </type>
  </resources>
  <resources>
    <name>Товары</name>
    <type>
      <types>EnumRef.СоставыСписковРетроБонусов</types>
    </type>
  </resources>
  <resources>
    <name>УчитыватьНДС</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>БонусПроцент</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаПлан</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
    </type>
  </resources>
  <resources>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </resources>
  <resources>
    <name>ПериодичностьУсловий</name>
    <type>
      <types>EnumRef.ПериодичностиРетроБонусов</types>
    </type>
  </resources>
  <resources>
    <name>ПериодичностьНачислений</name>
    <type>
      <types>EnumRef.ПериодичностиРетроБонусов</types>
    </type>
  </resources>
  <resources>
    <name>ДетализацияРасчетаУчастников</name>
    <type>
      <types>EnumRef.ДетализацияРасчетаУчастниковРетроБонусов</types>
    </type>
  </resources>
  <resources>
    <name>ЗапретНачисленияСверхПлана</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СегментыЗафиксированы</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <resources>
    <name>ВидШкалыРасчета</name>
    <comment>Для базы по количеству: 0 - прогрессивная шкала, 1 - по диапазонам.  Для базы по сумме: 0 - одно значение, 1 - прогрессивная шкала, 2 - по диапазонам.</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>РегистраторДвижения</name>
    <type>
      <types>DocumentRef.УсловияРетроБонусовКлиентов</types>
    </type>
  </attributes>
  <dimensions>
    <name>НачалоДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ОкончаниеДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ДокументУсловий</name>
    <type>
      <types>DocumentRef.УсловияРетроБонусовКлиентов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

trade/src/Enums/СоставыУчастниковРетроБонусов/СоставыУчастниковРетроБонусов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СоставыУчастниковРетроБонусов</name>
  <enumValues>
    <name>ИНН</name>
  </enumValues>
  <enumValues>
    <name>Контрагенты</name>
  </enumValues>
  <enumValues>
    <name>Клиенты</name>
  </enumValues>
  <enumValues>
    <name>СегментыПартнеров</name>
  </enumValues>
  <enumValues>
    <name>Договоры</name>
  </enumValues>
  <enumValues>
    <name>Соглашения</name>
  </enumValues>
</mdclass:Enum>

trade/src/Enums/СоставыТоваровРетроБонусов/СоставыТоваровРетроБонусов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СоставыТоваровРетроБонусов</name>
  <enumValues>
    <name>Номенклатура</name>
  </enumValues>
  <enumValues>
    <name>СегментыНоменклатуры</name>
  </enumValues>
</mdclass:Enum>

trade/src/Enums/СоставыСписковРетроБонусов/СоставыСписковРетроБонусов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СоставыСписковРетроБонусов</name>
  <enumValues>
    <name>Все</name>
  </enumValues>
  <enumValues>
    <name>Выбранные</name>
  </enumValues>
  <enumValues>
    <name>КромеВыбранных</name>
  </enumValues>
</mdclass:Enum>

trade/src/Enums/СтатусыДокументовРетроБонусов/СтатусыДокументовРетроБонусов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыДокументовРетроБонусов</name>
  <enumValues>
    <name>Черновик</name>
  </enumValues>
  <enumValues>
    <name>НаСогласовании</name>
  </enumValues>
  <enumValues>
    <name>Согласован</name>
  </enumValues>
  <enumValues>
    <name>НеСогласован</name>
  </enumValues>
</mdclass:Enum>

trade/src/Catalogs/ВидыРетроБонусовКлиентов/ВидыРетроБонусовКлиентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыРетроБонусовКлиентов</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыВидовРетроБонусов</types>
    </type>
  </attributes>
  <attributes>
    <name>НачалоДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОкончаниеДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БезРасчета</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказательТоваров</name>
    <type>
      <types>EnumRef.ЦелевыеПоказателиРетроБонусовПоТоварам</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодичностьУсловий</name>
    <type>
      <types>EnumRef.ПериодичностиРетроБонусов</types>
    </type>
  </attributes>
  <attributes>
    <name>ДетализацияРасчетаУчастников</name>
    <type>
      <types>EnumRef.ДетализацияРасчетаУчастниковРетроБонусов</types>
    </type>
  </attributes>
  <attributes>
    <name>БазаРасчетаПродаж</name>
    <type>
      <types>EnumRef.БазыРасчетаРетроБонусов</types>
    </type>
  </attributes>
  <attributes>
    <name>УчитыватьНДС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПорядокРаспределения</name>
    <type>
      <types>EnumRef.ПорядкиРаспределенияРетроБонусов</types>
    </type>
  </attributes>
  <attributes>
    <name>СоставУчастников</name>
    <type>
      <types>EnumRef.СоставыУчастниковРетроБонусов</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтборУчастников</name>
    <type>
      <types>EnumRef.СоставыСписковРетроБонусов</types>
    </type>
  </attributes>
  <attributes>
    <name>СоставТоваров</name>
    <type>
      <types>EnumRef.СоставыТоваровРетроБонусов</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтборТоваров</name>
    <type>
      <types>EnumRef.СоставыСписковРетроБонусов</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодичностьНачислений</name>
    <type>
      <types>EnumRef.ПериодичностиРетроБонусов</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

trade/src/Reports/СоставСегментовРетроБонусовКлиентов/ObjectModule.bsl
//@strict-types

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

// При компоновке результата.
// 
// Параметры:
//  ДокументРезультат - ТабличныйДокумент - Документ результат
//  ДанныеРасшифровки - ДанныеРасшифровкиКомпоновкиДанных - Данные расшифровки
//  СтандартнаяОбработка - Булево - Стандартная обработка
//
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	НастройкиОтчета = КомпоновщикНастроек.ПолучитьНастройки();
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	
	ДокументУРБ = КомпоновкаДанныхКлиентСервер.ПолучитьПараметр(НастройкиОтчета, "ДокументУРБ").Значение;  // ДокументСсылка.УсловияРетроБонусовКлиентов
	ВариантОтчета = КомпоновкаДанныхКлиентСервер.ПолучитьПараметр(НастройкиОтчета, "ВариантОтчета").Значение;  // Строка 
	ВыводитьАртикул = КомпоновкаДанныхКлиентСервер.ПолучитьПараметр(НастройкиОтчета, "ВыводитьАртикул").Значение;  // Булево
	ПоДаннымДокумента = (ВариантОтчета = 2);
	
	СтруктураПараметров = ДополнительныеПараметрыПоУРБ(ДокументУРБ, ПоДаннымДокумента);
	СтруктураПараметров.ВыводитьАртикул = ВыводитьАртикул;
	ОформитьЗаголовки(НастройкиОтчета, СтруктураПараметров, ПоДаннымДокумента);
	
	НаборыДанных = ИнициализироватьВнешнийНаборДанных(СтруктураПараметров, ПоДаннымДокумента);
	
	КомментарийСегментыНеЗафиксированы = НСтр("ru = 'Данные о составе сегментов не зафиксированы, могут быть изменены по правилам формирования сегментов'");
	КомпоновкаДанныхКлиентСервер.УстановитьПараметр(
		НастройкиОтчета,
		"КомментарийСегментыНеЗафиксированы",
		КомментарийСегментыНеЗафиксированы);
	
	КомментарийСегментыЗафиксированы = НСтр("ru = 'Расчет и начисление ретро-бонуса осуществляется по данным зафиксированного состава сегментов'");
	КомпоновкаДанныхКлиентСервер.УстановитьПараметр(
		НастройкиОтчета,
		"КомментарийСегментыЗафиксированы",
		КомментарийСегментыЗафиксированы);
	
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, НастройкиОтчета, ДанныеРасшифровки);
	
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, НаборыДанных, ДанныеРасшифровки);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	
	ОтчетПустой = ОтчетыСервер.ОтчетПустой(ЭтотОбъект, ПроцессорКомпоновки);
	КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.Вставить("ОтчетПустой", ОтчетПустой);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Настройки общей формы отчета подсистемы "Варианты отчетов".
//
// Параметры:
//   Форма - ФормаКлиентскогоПриложения, Неопределено - Форма отчета или форма настроек отчета.
//       Неопределено когда вызов без контекста.
//   КлючВарианта - Строка, Неопределено - Имя предопределенного
//       или уникальный идентификатор пользовательского варианта отчета.
//       Неопределено когда вызов без контекста.
//   Настройки - См. ОтчетыКлиентСервер.НастройкиОтчетаПоУмолчанию
//
Процедура ОпределитьНастройкиФормы(Форма, КлючВарианта, Настройки) Экспорт
	
	Настройки.ФормироватьСразу = Истина;
	Настройки.РазрешеноИзменятьВарианты = Ложь;
	Настройки.РазрешеноИзменятьСтруктуру = Ложь;
	
	Настройки.События.ПриСозданииНаСервере = Истина;
	Настройки.События.ПередЗагрузкойНастроекВКомпоновщик = Истина;
	
КонецПроцедуры

// Вызывается в обработчике одноименного события формы отчета после выполнения кода формы.
//
// Параметры:
//   Форма - ФормаКлиентскогоПриложения - Форма отчета:
//      * Отчет - ОтчетОбъект.РасчетРетроБонусовКлиентов
//      * Параметры - Структура:
//         ** ПараметрКоманды - ДокументСсылка.УсловияРетроБонусовКлиентов
//   Отказ - Булево - Признак отказа от создания формы.
//      См. описание одноименного параметра "ФормаКлиентскогоПриложения.ПриСозданииНаСервере" в синтакс-помощнике.
//   СтандартнаяОбработка - Булево - Признак выполнения стандартной (системной) обработки события.
//      См. описание одноименного параметра "ФормаКлиентскогоПриложения.ПриСозданииНаСервере" в синтакс-помощнике.
//
// См. также:
//   Процедура для вывода добавленных команд в форму: ОтчетыСервер.ВывестиКоманду().
//   Глобальный обработчик этого события: ОтчетыПереопределяемый.ПриСозданииНаСервере().
//
Процедура ПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка) Экспорт
	
	Параметры = Форма.Параметры;
	НастройкиОтчета = КомпоновщикНастроек.ПолучитьНастройки(); 
	
	ПоДаннымДокумента = Ложь;
	Если НастройкиОтчета.ДополнительныеСвойства.КлючВарианта = "СоставСегментовРетроБонусовКлиентовПоДаннымДокументаКонтекст" Тогда
		
		ПоДаннымДокумента = Истина;
		
	КонецЕсли;
	
	Если Параметры.Свойство("ПараметрКоманды") Тогда
		
		ПараметрКоманды = Параметры.ПараметрКоманды; // ДокументСсылка.УсловияРетроБонусовКлиентов
		ТипПараметраКоманды = ТипЗнч(ПараметрКоманды);
		
		Форма.НастройкиОтчета.РазрешеноВыбиратьВарианты = Ложь;
		
		Если ТипПараметраКоманды = Тип("ДокументСсылка.УсловияРетроБонусовКлиентов") Тогда
			
			СтруктураПараметров = ДополнительныеПараметрыПоУРБ(ПараметрКоманды, ПоДаннымДокумента);
			СоставУчастников = СтруктураПараметров.СоставУчастников;
			СоставТоваров = СтруктураПараметров.СоставТоваров;
			СоставСегментыПоПартнерам = (СоставУчастников = Перечисления.СоставыУчастниковРетроБонусов.СегментыПартнеров);
			СоставСегментыНоменклатуры = (СоставТоваров = Перечисления.СоставыТоваровРетроБонусов.СегментыНоменклатуры);
			УРБСогласован = СтруктураПараметров.УРБСогласован;
			
			Если НЕ УРБСогласован
			   И НЕ ПоДаннымДокумента Тогда
					
				ТекстСообщения = НСтр("ru = 'Формирование отчета предусмотрено только для согласованных условий и с настройкой по сегментам клиентов или товаров.'");
				ВызватьИсключение ТекстСообщения;
					
			ИначеЕсли НЕ СоставСегментыПоПартнерам
			   И НЕ СоставСегментыНоменклатуры Тогда
				
				ТекстСообщения = НСтр("ru = 'Формирование отчета предусмотрено только для документов с настройкой по сегментам клиентов или товаров.'");
				ВызватьИсключение ТекстСообщения;
				
			КонецЕсли;
			
			ДобавляемыеРеквизитыФормы = Новый Массив(); // Массив из РеквизитФормы
			
			ТипСтрока = Новый ОписаниеТипов("ПеречислениеСсылка.СоставыТоваровРетроБонусов");
			ИмяРеквизита = "СоставТоваров";
			
			НовыйРеквизит = Новый РеквизитФормы(ИмяРеквизита, ТипСтрока);
			ДобавляемыеРеквизитыФормы.Добавить(НовыйРеквизит);
			
			Форма.ИзменитьРеквизиты(ДобавляемыеРеквизитыФормы);
			
			ОбщегоНазначенияКлиентСервер.УстановитьРеквизитФормыПоПути(
				Форма, ИмяРеквизита, СоставТоваров);
			
		КонецЕсли;
		
	ИначеЕсли НЕ ЗначениеЗаполнено(Параметры.ПредставлениеВарианта) Тогда
		
		Отказ = Истина;
		СинонимДокумента = Метаданные.Документы.УсловияРетроБонусовКлиентов.Синоним;
		ШаблонОшибки = НСтр("ru= 'Отчет предназначен только для открытия из документа ""%1"".'");
		ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонОшибки, СинонимДокумента);
		ВызватьИсключение ТекстОшибки;
		
	КонецЕсли;

КонецПроцедуры

// Вызывается перед загрузкой новых настроек. Используется для изменения схемы компоновки.
//   Например, если схема отчета зависит от ключа варианта или параметров отчета.
//   Чтобы изменения схемы вступили в силу следует вызывать метод ОтчетыСервер.ПодключитьСхему().
//
// Параметры:
//   Контекст - См. ОбщаяФорма.ФормаОтчета
//   КлючСхемы - Строка -
//       Идентификатор текущей схемы компоновщика настроек.
//       По умолчанию не заполнен (это означает что компоновщик инициализирован на основании основной схемы).
//       Используется для оптимизации, чтобы переинициализировать компоновщик как можно реже).
//       Может не использоваться, если переинициализация выполняется безусловно.
//   КлючВарианта - Строка, Неопределено -
//       Имя предопределенного или уникальный идентификатор пользовательского варианта отчета.
//       Неопределено, когда вызов для варианта расшифровки или без контекста.
//   НовыеНастройкиКД - НастройкиКомпоновкиДанных, Неопределено -
//       Настройки варианта отчета, которые будут загружены в компоновщик настроек после его инициализации.
//       Неопределено, когда настройки варианта не надо загружать (уже загружены ранее).
//   НовыеПользовательскиеНастройкиКД - ПользовательскиеНастройкиКомпоновкиДанных, Неопределено -
//       Пользовательские настройки, которые будут загружены в компоновщик настроек после его инициализации.
//       Неопределено, когда пользовательские настройки не надо загружать (уже загружены ранее).
//
Процедура ПередЗагрузкойНастроекВКомпоновщик(Контекст, КлючСхемы, КлючВарианта, НовыеНастройкиКД, НовыеПользовательскиеНастройкиКД) Экспорт
	
	Если КлючСхемы = КлючВарианта Тогда
		Возврат;
	КонецЕсли;
	
	Если НовыеНастройкиКД = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(Контекст) = Тип("ФормаКлиентскогоПриложения") Тогда
		
		Параметры = Контекст.Параметры;
		Если Параметры.Свойство("ПараметрКоманды") Тогда
			
			ПараметрКоманды = Параметры.ПараметрКоманды; // ДокументСсылка.УсловияРетроБонусовКлиентов
			ЗаполнитьПараметрыПоКонтексту(ПараметрКоманды, НовыеНастройкиКД);
			
			Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Контекст, "СоставТоваров") Тогда
				
				СоставТоваров = Контекст.СоставТоваров;
				
				Если СоставТоваров <> Перечисления.СоставыТоваровРетроБонусов.СегментыНоменклатуры Тогда
					
					ВыводитьАртикул = СхемаКомпоновкиДанных.Параметры.ВыводитьАртикул;
					ВыводитьАртикул.ОграничениеИспользования = Истина;
					ОтчетыСервер.ПодключитьСхему(ЭтотОбъект, Контекст, СхемаКомпоновкиДанных, КлючСхемы);
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	КлючСхемы = КлючВарианта;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ОформитьЗаголовки(НастройкиОтчета, СтруктураПараметров, ПоДаннымДокумента)
	
	СоставУчастников = СтруктураПараметров.СоставУчастников;
	СоставТоваров = СтруктураПараметров.СоставТоваров;
	Участники = СтруктураПараметров.Участники;
	Товары = СтруктураПараметров.Товары;
	СегментыЗафиксированы = СтруктураПараметров.СегментыЗафиксированы;
	ВыводитьАртикул = СтруктураПараметров.ВыводитьАртикул;
	
	Если ПоДаннымДокумента Тогда
		ПредставлениеДокумента = СтруктураПараметров.ДокументУРБПредставление;
	Иначе
		ПредставлениеДокумента = СтруктураПараметров.ДокументУРБПервичныйПредставление;
	КонецЕсли;
		
	ШаблонЗаголовка = НСтр("ru = 'Состав сегментов документа %1'");
	ЗаголовокОтчета = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонЗаголовка, ПредставлениеДокумента);
	КомпоновкаДанныхКлиентСервер.УстановитьПараметрВывода(НастройкиОтчета, "Заголовок", ЗаголовокОтчета);
	
	Для Каждого ЭлементСтруктуры Из НастройкиОтчета.Структура Цикл
		
		Если ЭлементСтруктуры.Имя = "Товары" Тогда
			
			Если СоставТоваров = Перечисления.СоставыТоваровРетроБонусов.СегментыНоменклатуры Тогда
				
				Если Товары = Перечисления.СоставыСписковРетроБонусов.Выбранные Тогда
					
					ЗаголовокГруппировки = НСтр("ru = 'Выбранные товары'");
					
				Иначе
					
					ЗаголовокГруппировки = НСтр("ru = 'Все кроме выбранных товаров'");
					
				КонецЕсли;
				КомпоновкаДанныхКлиентСервер.УстановитьПараметрВывода(ЭлементСтруктуры, "Заголовок", ЗаголовокГруппировки);
				
				ПолеКомпоновки = Новый ПолеКомпоновкиДанных("Артикул");
				
				Для Каждого ПолеГруппировки Из ЭлементСтруктуры.ПоляГруппировки.Элементы Цикл
				
					Если ТипЗнч(ПолеГруппировки) = Тип("ПолеГруппировкиКомпоновкиДанных")
					   И ПолеГруппировки.Поле = ПолеКомпоновки Тогда
					   
						ПолеГруппировки.Использование = ВыводитьАртикул;
						Прервать;
						
					КонецЕсли;
					
				КонецЦикла;
				
			Иначе
				
				ЭлементСтруктуры.Использование = Ложь;
				
			КонецЕсли;
			
		ИначеЕсли ЭлементСтруктуры.Имя = "Партнеры" Тогда
			
			Если СоставУчастников = Перечисления.СоставыУчастниковРетроБонусов.СегментыПартнеров Тогда
				
				Если Участники = Перечисления.СоставыСписковРетроБонусов.Выбранные Тогда
					
					ЗаголовокГруппировки = НСтр("ru = 'Выбранные клиенты'");
					
				Иначе
					
					ЗаголовокГруппировки = НСтр("ru = 'Все кроме выбранных клиентов'");
					
				КонецЕсли;
				КомпоновкаДанныхКлиентСервер.УстановитьПараметрВывода(ЭлементСтруктуры, "Заголовок", ЗаголовокГруппировки);
				
			Иначе
				
				ЭлементСтруктуры.Использование = Ложь;
				
			КонецЕсли;
			
		ИначеЕсли ЭлементСтруктуры.Имя = "КомментарийСегментыНеЗафиксированы" Тогда
			
			ИспользоватьГруппировку = (НЕ СегментыЗафиксированы И НЕ ПоДаннымДокумента);
			ЭлементСтруктуры.Использование = ИспользоватьГруппировку; 
			
		ИначеЕсли ЭлементСтруктуры.Имя = "КомментарийСегментыЗафиксированы" Тогда
			
			ИспользоватьГруппировку = (СегментыЗафиксированы И НЕ ПоДаннымДокумента);
			ЭлементСтруктуры.Использование = ИспользоватьГруппировку;
			
		ИначеЕсли ЭлементСтруктуры.Имя = "КомментарийПустой" Тогда
			
			ЭлементСтруктуры.Использование = Истина;
			
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры

// Заполняет параметры из переданного контекста.
// 
// Параметры:
//  ПараметрКоманды - ЛюбаяСсылка
//   НовыеНастройкиКД - НастройкиКомпоновкиДанных, Неопределено -
//       Настройки варианта отчета, которые будут загружены в компоновщик настроек после его инициализации.
//       Неопределено, когда настройки варианта не надо загружать (уже загружены ранее).
//
Процедура ЗаполнитьПараметрыПоКонтексту(ПараметрКоманды, НовыеНастройкиКД)
	
	ТипПараметраКоманды = ТипЗнч(ПараметрКоманды);
	
	Если ТипПараметраКоманды = Тип("ДокументСсылка.УсловияРетроБонусовКлиентов") Тогда
		
		КомпоновкаДанныхКлиентСервер.УстановитьПараметр(НовыеНастройкиКД, "ДокументУРБ", ПараметрКоманды);
		
	КонецЕсли;
	
КонецПроцедуры

Функция ИнициализироватьВнешнийНаборДанных(СтруктураПараметров, ПоДаннымДокумента)
	
	НаборДанных = Новый Структура;
	НаборДанных.Вставить("НаборДанныхТовары", Новый ТаблицаЗначений);
	НаборДанных.Вставить("НаборДанныхПартнеры", Новый ТаблицаЗначений);
	
	ДокументУРБ = СтруктураПараметров.ДокументУРБ;
	ДокументУРБПервичный = СтруктураПараметров.ДокументУРБПервичный;
	СоставУчастников = СтруктураПараметров.СоставУчастников;
	СоставТоваров = СтруктураПараметров.СоставТоваров;
	СегментыЗафиксированы = СтруктураПараметров.СегментыЗафиксированы;
	
	СоставСегментыПоПартнерам = (СоставУчастников = Перечисления.СоставыУчастниковРетроБонусов.СегментыПартнеров);
	СоставСегментыНоменклатуры = (СоставТоваров = Перечисления.СоставыТоваровРетроБонусов.СегментыНоменклатуры);
	
	Если СоставСегментыПоПартнерам
	 ИЛИ СоставСегментыНоменклатуры Тогда
	
		Если СегментыЗафиксированы
		   И НЕ ПоДаннымДокумента Тогда
			
			Запрос = Новый Запрос;
			Запрос.УстановитьПараметр("ДокументУсловий", ДокументУРБПервичный);
			Запрос.УстановитьПараметр("СоставСегментыПоПартнерам", СоставСегментыПоПартнерам);
			Запрос.УстановитьПараметр("СоставСегментыНоменклатуры", СоставСегментыНоменклатуры);
			
			Запрос.Текст =
			"ВЫБРАТЬ
			|	РетроБонусыКлиентовТовары.Номенклатура КАК Номенклатура,
			|	РетроБонусыКлиентовТовары.Характеристика КАК Характеристика
			|ИЗ
			|	РегистрСведений.РетроБонусыКлиентовТовары КАК РетроБонусыКлиентовТовары
			|ГДЕ
			|	РетроБонусыКлиентовТовары.ДокументУсловий = &ДокументУсловий
			|	И &СоставСегментыНоменклатуры
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	РетроБонусыКлиентовКонтрагенты.Партнер КАК Партнер
			|ИЗ
			|	РегистрСведений.РетроБонусыКлиентовКонтрагенты КАК РетроБонусыКлиентовКонтрагенты
			|ГДЕ
			|	РетроБонусыКлиентовКонтрагенты.ДокументУсловий = &ДокументУсловий
			|	И &СоставСегментыПоПартнерам"; 
			
			Результат = Запрос.ВыполнитьПакет();
			НаборДанных.НаборДанныхТовары = Результат[0].Выгрузить();
			НаборДанных.НаборДанныхПартнеры = Результат[1].Выгрузить();
			
		Иначе 
			
			Если ПоДаннымДокумента Тогда
				
				НаборДанных.НаборДанныхТовары = РетроБонусыСервер.ЗаполнитьДанныеДляФиксацииСегментовТоваров(
					ДокументУРБ, 
					ПоДаннымДокумента);
					
				НаборДанных.НаборДанныхПартнеры = РетроБонусыСервер.ЗаполнитьДанныеДляФиксацииСегментовПартнеров(
					ДокументУРБ, 
					ПоДаннымДокумента);
				
			Иначе
				
				НаборДанных.НаборДанныхТовары = РетроБонусыСервер.ЗаполнитьДанныеДляФиксацииСегментовТоваров(ДокументУРБПервичный);
				НаборДанных.НаборДанныхПартнеры = РетроБонусыСервер.ЗаполнитьДанныеДляФиксацииСегментовПартнеров(ДокументУРБПервичный);
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат НаборДанных;
	
КонецФункции

Функция ДополнительныеПараметрыПоУРБ(ДокументУРБ, ПоДаннымДокумента = Ложь)
	
	СтруктураПараметров = СтруктураПараметровОтчета();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДокументУсловий", ДокументУРБ);
	Запрос.УстановитьПараметр("ПоДаннымДокумента", ПоДаннымДокумента);
	
	Если ПоДаннымДокумента Тогда
		
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	ДанныеУсловий.ОтборУчастников КАК Участники,
		|	ДанныеУсловий.ОтборТоваров КАК Товары,
		|	ЕСТЬNULL(ВидыРетроБонусовКлиентов.СоставУчастников,
		|		ЗНАЧЕНИЕ(Перечисление.СоставыУчастниковРетроБонусов.ПустаяСсылка)) КАК СоставУчастников,
		|	ЕСТЬNULL(ВидыРетроБонусовКлиентов.СоставТоваров, ЗНАЧЕНИЕ(Перечисление.СоставыТоваровРетроБонусов.ПустаяСсылка)) КАК СоставТоваров,
		|	ЛОЖЬ КАК СегментыЗафиксированы,
		|	ДанныеУсловий.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыДокументовРетроБонусов.Согласован) КАК УРБСогласован,
		|	ВЫБОР
		|		КОГДА ДанныеУсловий.Исправление
		|			ТОГДА ДанныеУсловий.ИсправляемыйДокумент
		|		ИНАЧЕ ДанныеУсловий.Ссылка
		|	КОНЕЦ КАК ДокументУРБПервичный,
		|	ДанныеУсловий.Представление КАК ДокументУРБПредставление,
		|	ВЫБОР
		|		КОГДА ДанныеУсловий.Исправление
		|			ТОГДА ДанныеУсловий.ИсправляемыйДокумент.Представление
		|		ИНАЧЕ ДанныеУсловий.Представление
		|	КОНЕЦ КАК ДокументУРБПервичныйПредставление
		|ИЗ
		|	Документ.УсловияРетроБонусовКлиентов КАК ДанныеУсловий
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВидыРетроБонусовКлиентов КАК ВидыРетроБонусовКлиентов
		|		ПО ДанныеУсловий.ВидРетроБонуса = ВидыРетроБонусовКлиентов.Ссылка
		|ГДЕ
		|	ДанныеУсловий.Ссылка = &ДокументУсловий";
		
	Иначе
		
		ТекстЗапроса =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЕСТЬNULL(РетроБонусыКлиентовУсловия.Участники, ЗНАЧЕНИЕ(Перечисление.СоставыСписковРетроБонусов.ПустаяСсылка)) КАК Участники,
		|	ЕСТЬNULL(РетроБонусыКлиентовУсловия.Товары, ЗНАЧЕНИЕ(Перечисление.СоставыСписковРетроБонусов.ПустаяСсылка)) КАК Товары,
		|	ЕСТЬNULL(РетроБонусыКлиентовУсловия.СоставУчастников, ЗНАЧЕНИЕ(Перечисление.СоставыУчастниковРетроБонусов.ПустаяСсылка)) КАК СоставУчастников,
		|	ЕСТЬNULL(РетроБонусыКлиентовУсловия.СоставТоваров, ЗНАЧЕНИЕ(Перечисление.СоставыТоваровРетроБонусов.ПустаяСсылка)) КАК СоставТоваров,
		|	ЕСТЬNULL(РетроБонусыКлиентовУсловия.СегментыЗафиксированы, ЛОЖЬ) КАК СегментыЗафиксированы,
		|	ЕСТЬNULL(РетроБонусыКлиентовУсловия.ДокументУсловий, ЛОЖЬ) <> ЛОЖЬ КАК УРБСогласован,
		|	ЕСТЬNULL(РетроБонусыКлиентовУсловия.ДокументУсловий, ЗНАЧЕНИЕ(Документ.УсловияРетроБонусовКлиентов.ПустаяСсылка)) КАК ДокументУРБПервичный,
		|	ДанныеУсловий.Представление КАК ДокументУРБПредставление,
		|	ВЫБОР
		|		КОГДА НЕ РетроБонусыКлиентовУсловия.ДокументУсловий ЕСТЬ NULL
		|			ТОГДА РетроБонусыКлиентовУсловия.ДокументУсловий.Представление
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК ДокументУРБПервичныйПредставление
		|ИЗ
		|	Документ.УсловияРетроБонусовКлиентов КАК ДанныеУсловий
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РетроБонусыКлиентовУсловия КАК РетроБонусыКлиентовУсловия
		|		ПО ДанныеУсловий.ИсправляемыйДокумент = РетроБонусыКлиентовУсловия.ДокументУсловий
		|		И ДанныеУсловий.Исправление
		|ГДЕ
		|	ДанныеУсловий.Ссылка = &ДокументУсловий
		|	И НЕ РетроБонусыКлиентовУсловия.ДокументУсловий ЕСТЬ NULL
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЕСТЬNULL(РетроБонусыКлиентовУсловия.Участники, ЗНАЧЕНИЕ(Перечисление.СоставыСписковРетроБонусов.ПустаяСсылка)),
		|	ЕСТЬNULL(РетроБонусыКлиентовУсловия.Товары, ЗНАЧЕНИЕ(Перечисление.СоставыСписковРетроБонусов.ПустаяСсылка)),
		|	ЕСТЬNULL(РетроБонусыКлиентовУсловия.СоставУчастников, ЗНАЧЕНИЕ(Перечисление.СоставыУчастниковРетроБонусов.ПустаяСсылка)),
		|	ЕСТЬNULL(РетроБонусыКлиентовУсловия.СоставТоваров, ЗНАЧЕНИЕ(Перечисление.СоставыТоваровРетроБонусов.ПустаяСсылка)),
		|	ЕСТЬNULL(РетроБонусыКлиентовУсловия.СегментыЗафиксированы, ЛОЖЬ),
		|	ЕСТЬNULL(РетроБонусыКлиентовУсловия.ДокументУсловий, ЛОЖЬ) <> ЛОЖЬ,
		|	ЕСТЬNULL(РетроБонусыКлиентовУсловия.ДокументУсловий, ЗНАЧЕНИЕ(Документ.УсловияРетроБонусовКлиентов.ПустаяСсылка)),
		|	ДанныеУсловий.Представление КАК ДокументУРБПредставление,
		|	ВЫБОР
		|		КОГДА НЕ РетроБонусыКлиентовУсловия.ДокументУсловий ЕСТЬ NULL
		|			ТОГДА РетроБонусыКлиентовУсловия.ДокументУсловий.Представление
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК ДокументУРБПервичныйПредставление
		|ИЗ
		|	Документ.УсловияРетроБонусовКлиентов КАК ДанныеУсловий
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РетроБонусыКлиентовУсловия КАК РетроБонусыКлиентовУсловия
		|		ПО ДанныеУсловий.Ссылка = РетроБонусыКлиентовУсловия.ДокументУсловий
		|			И (НЕ ДанныеУсловий.Исправление)
		|ГДЕ
		|	ДанныеУсловий.Ссылка = &ДокументУсловий
		|	И НЕ РетроБонусыКлиентовУсловия.ДокументУсловий ЕСТЬ NULL";
		
	КонецЕсли;
	
	Запрос.Текст = ТекстЗапроса;
	Результат = Запрос.Выполнить();
	Если НЕ Результат.Пустой() Тогда
		
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		ЗаполнитьЗначенияСвойств(СтруктураПараметров, Выборка);
		
	КонецЕсли;
	
	СтруктураПараметров.ДокументУРБ = ДокументУРБ;
	
	Возврат СтруктураПараметров;
	
КонецФункции

Функция СтруктураПараметровОтчета()
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ДокументУРБ", Документы.УсловияРетроБонусовКлиентов.ПустаяСсылка());
	СтруктураПараметров.Вставить("ДокументУРБПервичный", Документы.УсловияРетроБонусовКлиентов.ПустаяСсылка());
	СтруктураПараметров.Вставить("ДокументУРБПредставление", "");
	СтруктураПараметров.Вставить("ДокументУРБПервичныйПредставление", "");
	СтруктураПараметров.Вставить("СоставУчастников", Перечисления.СоставыУчастниковРетроБонусов.ПустаяСсылка());
	СтруктураПараметров.Вставить("СоставТоваров", Перечисления.СоставыТоваровРетроБонусов.ПустаяСсылка());
	СтруктураПараметров.Вставить("Участники", Перечисления.СоставыСписковРетроБонусов.ПустаяСсылка());
	СтруктураПараметров.Вставить("Товары", Перечисления.СоставыСписковРетроБонусов.ПустаяСсылка());
	СтруктураПараметров.Вставить("СегментыЗафиксированы", Ложь);
	СтруктураПараметров.Вставить("УРБСогласован", Ложь);
	СтруктураПараметров.Вставить("ВыводитьАртикул", Ложь);
	
	Возврат СтруктураПараметров;
	
КонецФункции

#КонецОбласти

#КонецЕсли
